from logging import info

import pandas as pd

def 국토교통부():
    df = pd.read_csv('국토교통부_외국인_조종사_국적별_현황_20250331.csv',encoding='cp949')
    # TODO: 상위 5개의 행을 출력하시오.
    print("상위 5개의 행 : ", df.head())
    print('='*60)
    # TODO: 하위 5개의 행을 출력하시오.
    print("하위 5개의 행 : ", df.tail())
    print('='*60)
    # TODO: 행과 열의 개수를 출력하시오.
    print("행과 열의 개수 : ", df.shape)
    print('='*60)
    # TODO: 데이터 타입과 결측치 정보를 출력하시오.
    print("csv 정보 : ", df.info())
    print('='*60)
    # TODO: 평균, 최소, 최대 등 통계 요약 정보를 출력하시오.
    print("csv 요약정보 : ", df.describe())
    print('='*60)
    # TODO: '국적' 컬럼 하나만 가져와 출력하시오.
    df_국적 = df['국적']
    print(df_국적)
    print('='*60)
    # TODO: '국적', '대한항공', '아시아나항공' 3개 컬럼만 가져와 출력하시오.
    df_선택 = df[['국적', '대한항공', '아시아나항공']]
    print(df_선택)
    print('='*60)
    # TODO: 대한항공 외국인 조종사가 1명 이상인 국적만 필터링하여 출력하시오.
    df_대한항공 = df[df['대한항공'] >= 1 ]
    print("대한항공 외국인 조종사가 있는 국적 : ", df_대한항공)
    print('='*60)
    # TODO: 위 결과에서 총 몇 개 국적인지 출력하시오.
    print(f"총 국적 수 :  {len(df_대한항공)}")
    print('='*60)
    # TODO: 각 컬럼별 결측치 개수를 출력하시오.
    print("결측치 개수 : ", df.isnull().sum)
    print('='*60)
    # TODO: 결측치가 있는 행을 삭제하여 출력하시오.
    print("결측치 행 삭제 : ", df.dropna())
    print('='*60)
    # TODO: 결측치를 0으로 채워 출력하시오.
    결측치_0으로채운_데이터 = df.fillna(0)
    print("결측치 0으로 채우기 : ", 결측치_0으로채운_데이터)
    print('='*60)
    # TODO: 결측치를 숫자 컬럼의 평균값으로 채워 출력하시오.
    print("결측치 평균값으로 채우기 : ", df.fillna(df.mean(numeric_only=True)))
    print('='*60)
    # TODO: 결측치를 0으로 채운 데이터를
    # "외국인조종사_정제완료.csv" 파일로 저장하시오.
    # 인덱스는 저장하지 않으며, 한글이 깨지지 않게 저장할 것
    df.결측치_0으로채운_데이터.to_csv('외국인조종사_정제완료.csv', index=False, encoding='utf-8-sig')

def 경찰청():
    df = pd.read_csv('경찰청_범죄 발생 지역별 통계_20241231.csv',encoding='cp949')
    # TODO: 상위 5개의 행을 출력하시오.
    print("상위 5개의 행 : ", df.head())

    # TODO: 행과 열의 개수를 출력하시오.
    print("행과 열의 개수 : ", df.shape)

    # TODO: 데이터 타입과 결측치 정보를 출력하시오.
    df.info() # info() 기능에 출력이 내장되어 있음
    print('데이터 타입과 결측지 정보 : ',df.info())

    # TODO: 숫자 컬럼의 평균, 최소, 최대 등 통계 요약 정보를 출력하시오.
    print("통계 요약 : ", df.describe())

    # TODO: '범죄대분류', '범죄중분류', '서울 강남구', '서울 종로구' 4개 컬럼만 가져와 출력하시오.
    df_선택 = df[['범죄대분류', '범죄중분류', '서울 강남구', '서울 종로구']]
    print(df_선택)

    # TODO: 범죄대분류가 '강력범죄' 인 행만 필터링하여 출력하시오.
    df_강력범죄 = df[df['범죄대분류'] == '강력범죄']
    print("강력범죄 목록 : ", df_강력범죄)

    # TODO: 서울 강남구 범죄 발생 건수가 50건 이상인 행만 필터링하여 출력하시오.
    df_강남구_50이상 = df[df['서울 강남구'] >= 50]
    print("강남구 50건 이상 범죄 : ", df_강남구_50이상)

    # TODO: 위 결과가 총 몇 개의 행인지 출력하시오.
    print("총 행 수 : ", len(df_강남구_50이상))

    # TODO: '서울 강남구' 컬럼의 전체 합계를 출력하시오. (강남구 전체 범죄 건수)
    print("강남구 전체 범죄 건수 : ", df['서울 강남구'].sum())

    # TODO: '서울 강남구' 컬럼의 평균값을 출력하시오.
    print("강남구 범죄 평균 : ", df['서울 강남구'].mean())

    # TODO: '서울 강남구' 컬럼의 최댓값을 출력하시오.
    print("강남구 최다 범죄 건수 : ", df['서울 강남구'].max())

    # TODO: '범죄대분류', '범죄중분류', '서울 강남구', '부산 중구', '대구 중구' 컬럼만 추출하여
    # "범죄통계_정제완료.csv" 로 저장하시오.
    # 인덱스는 저장하지 않으며, 한글이 깨지지 않게 저장할 것
    df[['범죄대분류', '범죄중분류', '서울 강남구', '부산 중구', '대구 중구']].to_csv("범죄통계_정제완료.csv", index=False, encoding='utf-8-sig')
경찰청()