class 유튜브채널:
    플랫폼 = "유튜브"          # 클래스 변수 - "유튜브"

    def __init__(self, 채널명, 구독자):
        self.채널명 = 채널명
        self.구독자 = 구독자

    def 채널소개(self):
        print(f"채널명: {self.채널명}, 구독자: {self.구독자}, 플랫폼: {유튜브채널.플랫폼}")

A채널 = 유튜브채널("야호" , 244)
B채널 = 유튜브채널("춤추는고래", 400)

# 인스턴스 변수
print(A채널.채널명)   # 네가 넣은 채널명
print(B채널.구독자)   # 네가 넣은 구독자수

# 클래스 변수
print(A채널.플랫폼)   # 유튜브
print(B채널.플랫폼)   # 유튜브

# 메서드 호출
A채널.채널소개()
B채널.채널소개()

class 토스계좌:
    은행명 = "토스뱅크"           # 클래스 변수 - "토스뱅크"

    def __init__(self, 이름, 잔액):
        self.이름 = 이름
        self.잔액 = 잔액

    def 잔액확인(self):
        print(f"이름: {self.이름}, 잔액: {self.잔액}원, 은행: {토스계좌.은행명}")

    def 입금(self, 금액):
        self.잔액 = self.잔액 + 금액
        print(f"{금액}원 입금완료, 현재잔액: {self.잔액}원")

A계좌 = 토스계좌("철수", 10000)
B계좌 = 토스계좌("영희", 50000)

A계좌.잔액확인()
B계좌.잔액확인()

A계좌.입금(5000)   # 입금 후 잔액 15000

# 클래스 변수 변경
토스계좌.은행명 = "카카오뱅크"   # 아무 이름으로 바꿔봐
print(A계좌.은행명)        # 바뀐 이름
print(B계좌.은행명)        # 바뀐 이름

class 카카오유저:
    서비스 = "카카오톡"           # 클래스 변수 - "카카오톡"

    def __init__(self, 이름, 나이, 지역):
        self.이름 = 이름
        self.나이 = 나이
        self.지역 = 지역

    def 프로필(self):
        print(f"이름: {self.이름}, 나이: {self.나이}, 지역: {self.지역}, 서비스: {카카오유저.서비스}")

    def 메세지보내기(self, 받는사람, 내용):
        print(f"{self.이름} → {받는사람} : {내용}")

A유저 = 카카오유저("철수", 25, "서울")
B유저 = 카카오유저("영희", 20, "부산")
C유저 = 카카오유저("민준", 23, "대구")

# 인스턴스 변수
A유저.프로필()
B유저.프로필()

# 메세지 보내기
A유저.메세지보내기('영희', "안녕!")   # 철수 → 영희 : 안녕!

# 클래스 변수 변경
카카오유저.서비스 = "카카오페이"
print(A유저.서비스)   # 카카오페이
print(B유저.서비스)   # 카카오페이
print(C유저.서비스)   # 카카오페이